const lessons = {
    '№1. Виды слов': t1,
    '№22. Литературные приёмы': t2
}

function t1(){
    return <>
        <h1>№1. Виды слов</h1>
        <br/>
        <h2>Местоимения:</h2>
        <ul>
            <li>Личные: я, ты, мы</li>
            <li>Возвратное: себя</li>
            <li>Притяжательные (чей?): мой, твой, наш</li>
            <li>Указательные: тот, этот, такой, таков</li>
            <li>Вопросительные: кто? что? какой?</li>
            <li>Относительные: кто, что, какой</li>
            <li>Определительные: каждый, любой, другой</li>
            <li>Неопределённые: нЕкто, нЕчто</li>
            <li>Отрицательные: никтО, ничтО</li>
        </ul>
        <br/>
        <h2>Частицы:</h2>
        <ul>
            <li>Условное наклонение: бы, б</li>
            <li>Повелительное наклонение: давай, пусть</li>
            <li>Вопросительные: ли, разве, неужели</li>
            <li>Указательные: вот, вон</li>
            <li>Уточнительные: именно, как раз</li>
            <li>Усилительные: даже, ни, же, ведь, всё-таки</li>
            <li>Сомнительные: вряд ли, едва ли</li>
            <li>Ограничительные: только, лишь, почти</li>
            <li>Смягчительная: -ка</li>
            <li>Отрицательные: не, ни</li>
            <li>Образовательные: -то, -либо, -нибудь, кое-</li>
        </ul>
        <br/>
        <h2>Производные предлоги:</h2>
        <p>Вблизи, вглубь, вокруг, наперекор, напротив, в виде, в продолжениЕ, в результате, в течениЕ, во время, во имя, ВСледствиЕ, за исключением, за счёт, насчёт, благодаря, включая, не считая, невзирая на, несмотря на, ввиду, вместо, вроде, наподобиЕ, навстречу, вслед, взамен, сверх, в силу, помимо, в целях, в связи, впереди, посреди, в заключение, накануне, в завершение, в отличие, поверх, по мере, в пользу, позади, на протяжениИ, соразмерно, в сравнениИ</p>
    </>
}

function t2(){
    return <>
        <h1>№22. Литературные приёмы</h1>
        <br/>
        <p>Пока нет</p>
    </>
}

export default lessons