const word_sets = {
    'пре_при': `2
е и
пр.вратный е
пр.грешение е
пр.имущество е
пр.исподняя е
пр.клонный е
пр.кращение е
пр.небрежение е
пр.подавать е
пр.поднести е
пр.проводить е
пр.следовать е
пр.словутый е
пр.смыкаться е
пр.стол е
пр.баутка и
пр.вередливый и
пр.видение и
пр.гожий и
пр.знание и
пр.каз и
пр.ключение и
пр.лежный и
пр.личие и
пр.мета и
пр.митивный и
пр.оритет и
пр.скорбный и
пр.чудливый и`,
    'н_нн': `4
н нн
багря.ый н
верчё.ый парень н
ветре.ый н
воро.ой н
гости.ая н
жёва.ый н
зелё.ый н
клёва.ый н
кова.ый н
конче.ый н
крещё.ый н
муче.ик н
назва.ый брат н
писа.ая красавица н
посажё.ый отец н
прида.ое н
прощё.ое воскресенье н
пря.ый н
пудре.ица н
пья.ый н
ране.ый н
роже.ица н
румя.ый н
сангви.ик н
серебре.ик (монета) н
сви.ой (и другие притяжательные) н
смышлё.ый н
суже.ый н
труже.ик н
ю.ый н
ядрё.ый н
бесприда.ица нн
блаже.ый нн
венча.ый нн
виде.ый нн
деревя.ый нн
жела.ый нн
жема.ый нн
завеща.ый нн
казнё.ый нн
медле.ый нн
невида.ый нн
негада.ый нн
недюжи.ый нн
нежда.ый нн
неожида.ый нн
неслыха.ый нн
нечая.ый нн
обеща.ый нн
окая.ый нн
оловя.ый нн
отчая.ый нн
повере.ый в делах нн
подли.ый нн
преда.ый нн
рождё.ый нн
самонадея.ый нн
свяще.ый нн
слыша.ый нн
ставле.ик нн
стекля.ый нн
стра.ый нн`,
    'q_q': ''
}

export default word_sets